HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxFce_regdef.h
/** \\brief  CRC Register */
typedef struct _Ifx_FCE_IN0_CRC_Bits
{
    unsigned int CRC:32;                    /**< \brief [31:0] CRC Register (rwh) */
} Ifx_FCE_IN0_CRC_Bits;

/** \\brief  Input Register */
typedef struct _Ifx_FCE_IN0_IR_Bits
{
    unsigned int IR:32;                     /**< \brief [31:0] Input Register (rw) */
} Ifx_FCE_IN0_IR_Bits;

/** \\brief  CRC Result Register */
typedef struct _Ifx_FCE_IN0_RES_Bits
{
    unsigned int RES:32;                    /**< \brief [31:0] Result Register (rh) */
} Ifx_FCE_IN0_RES_Bits;

/** \\brief  CRC Check Register */
typedef struct _Ifx_FCE_IN1_CHECK_Bits
{
    unsigned int CHECK:32;                  /**< \brief [31:0] CHECK Register (rw) */
} Ifx_FCE_IN1_CHECK_Bits;

/** \\brief  CRC Register */
typedef struct _Ifx_FCE_IN1_CRC_Bits
{
    unsigned int CRC:32;                    /**< \brief [31:0] CRC Register (rwh) */
} Ifx_FCE_IN1_CRC_Bits;

/** \\brief  Input Register */
typedef struct _Ifx_FCE_IN1_IR_Bits
{
    unsigned int IR:32;                     /**< \brief [31:0] Input Register (rw) */
} Ifx_FCE_IN1_IR_Bits;

/** \\brief  CRC Result Register */
typedef struct _Ifx_FCE_IN1_RES_Bits
{
    unsigned int RES:32;                    /**< \brief [31:0] Result Register (rh) */
} Ifx_FCE_IN1_RES_Bits;

/** \\brief  CRC Check Register */
typedef struct _Ifx_FCE_IN2_CHECK_Bits
{
    unsigned int CHECK:16;                  /**< \brief [15:0] CHECK Register (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_FCE_IN2_CHECK_Bits;

/** \\brief  CRC Register */
typedef struct _Ifx_FCE_IN2_CRC_Bits
{
    unsigned int CRC:16;                    /**< \brief [15:0] CRC Register (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_FCE_IN2_CRC_Bits;

/** \\brief  Input Register */
typedef struct _Ifx_FCE_IN2_IR_Bits
{
    unsigned int IR:16;                     /**< \brief [15:0] Input Register (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_FCE_IN2_IR_Bits;

/** \\brief  CRC Result Register */
typedef struct _Ifx_FCE_IN2_RES_Bits
{
    unsigned int RES:16;                    /**< \brief [15:0] Result Register (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_FCE_IN2_RES_Bits;

/** \\brief  CRC Check Register */
typedef struct _Ifx_FCE_IN3_CHECK_Bits
{
    unsigned int CHECK:8;                   /**< \brief [7:0] CHECK Register (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_FCE_IN3_CHECK_Bits;

/** \\brief  CRC Register */
typedef struct _Ifx_FCE_IN3_CRC_Bits
{
    unsigned int CRC:8;                     /**< \brief [7:0] CRC Register (rwh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_FCE_IN3_CRC_Bits;

/** \\brief  Input Register */
typedef struct _Ifx_FCE_IN3_IR_Bits
{
    unsigned int IR:8;                      /**< \brief [7:0] Input Register (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_FCE_IN3_IR_Bits;

/** \\brief  CRC Result Register */
typedef struct _Ifx_FCE_IN3_RES_Bits
{
    unsigned int RES:8;                     /**< \brief [7:0] Result Register (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_FCE_IN3_RES_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_FCE_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_FCE_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_FCE_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_FCE_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_FCE_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_FCE_KRSTCLR_Bits;

/** \\brief  CRC Length Register */
typedef struct _Ifx_FCE_LENGTH_Bits
{
    unsigned int LENGTH:16;                 /**< \brief [15:0] Message Length Register (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_FCE_LENGTH_Bits;

/** \\brief  CRC Status Register */
typedef struct _Ifx_FCE_STS_Bits
{
    unsigned int CMF:1;                     /**< \brief [0:0] CRC Mismatch Flag (rwh) */
    unsigned int CEF:1;                     /**< \brief [1:1] Configuration Error Flag (rwh) */
    unsigned int LEF:1;                     /**< \brief [2:2] Length Error Flag (rwh) */
    unsigned int BEF:1;                     /**< \brief [3:3] Bus Error Flag (rwh) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_FCE_STS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Fce_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_FCE_ACCEN0_Bits B;
} Ifx_FCE_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_FCE_ACCEN1_Bits B;
} Ifx_FCE_ACCEN1;

/** \\brief  CRC Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_FCE_CFG_Bits B;
} Ifx_FCE_CFG;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_FCE_CLC_Bits B;
} Ifx_FCE_CLC;

/** \\brief  CRC Test Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_FCE_CTR_Bits B;
} Ifx_FCE_CTR;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_FCE_ID_Bits B;
} Ifx_FCE_ID;

/** \\brief  CRC Check Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_FCE_IN0_CHECK_Bits B;
} Ifx_FCE_IN0_CHECK;

